"""
templates хранит значения текстовых шаблонов.
"""

tmp_empty_input = "Вы ничего не ввели, попробуйте снова:"
tmp_choose_command = "Пожалуйста, введите одну из команд"

nameloc = "Название локации:"
title = "Заголовок локации:"
description = "Описание локации:"
links = "Переходы:"

tmp_create_loc = """Введите "создать" для создания новой локации;
"редактировать", чтобы увидеть список локаций для редактирования;
"проверка" для поиска ошибок в переходах;
"меню" для возврата в меню."""
tmp_loc_list = """Введите имя локации для её редактирования, или \"назад\", чтобы вернуться. 
Введите "удалить все", чтобы удалить ВСЕ локации.
Список существующих локаций:"""
tmp_no_locs = "Нет ни одной локации. Стартовая локация должна называться \"старт\"."
tmp_input_loc_data = "Нужно будет ввести данные по создаваемой локации."
tmp_input_loc_name = "Шаг 1: Введите название локации (не отображается в игре)"
tmp_input_loc_title = "Шаг 2: Введите заголовок локации"
tmp_input_loc_desc = "Шаг 3: Введите описание локации"
tmp_transitions = """Шаг 4: Переход на другую локацию состоит из двух элементов:
    1) Название локации, в которую отправится игрок (например "Коридор");
    2) Имя кнопки (например \"Выйти из комнаты\"),
Перед запуском игры убедитесь, что переходы ведут в существующие локации."""
tmp_input_button_name = "Введите имя кнопки:"
tmp_input_loc_button = "Введите название локации, в которую попадёт игрок:"

tmp_change_transition = "Для изменения перехода, введите название локации из переходов."
tmp_new_transition = "Если введёте что-то иное - создастся новый переход."

tmp_empty_to_pass = ", или оставьте строку пустой, чтобы оставить без изменений."